app/views/characters/_form.html.erb

SELECT "universes".* FROM "universes"
---
    <%= f.label :universe %><br>
    <%= collection_select(:character, :universe_id, Universe.all, :id, :name, include_blank: true) %>

SELECT "abilities".* FROM "abilities"
---
    <%= f.label :ability, "Abilities" %> <br>
    <%= collection_check_boxes(:character, :ability_ids, Ability.all, :id, :name) %>