app/views/characters/show.html.erb

SELECT "abilities".* FROM "abilities" INNER JOIN "character_abilities" ON "abilities"."id" = "character_abilities"."ability_id" WHERE "character_abilities"."character_id" = ?  [["character_id", 14]]
---
  <ul>
    <% @character.abilities.each do |ability| %>