app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE (alias LIKE '%%' OR first_name LIKE '%%')
---
  def index
    @characters = Character.all

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @character = Character.find_by_id(params[:id])

INSERT INTO "characters" ("alias", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["alias", "Professor X"], ["first_name", "Xavier"], ["last_name", "Charles"], ["created_at", "2016-05-04 23:33:54.599139"], ["updated_at", "2016-05-04 23:33:54.599139"]]
---
  def create
    @character = Character.new(character_params)

    if @character.save

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @character = Character.find_by_id(params[:id])

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "characters" SET "photo_updated_at" = ?, "photo_file_name" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["photo_updated_at", "2016-05-19 00:31:45.813247"], ["photo_file_name", "Captain-America-AOU-Render.png"], ["updated_at", "2016-05-19 00:31:48.516919"], ["id", 2]]
---
  def update
    @character = Character.find_by_id(params[:id])
    @character.update(character_params)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
---
  def destroy
    @character = Character.find_by_id(params[:id])
    @character.delete