app/controllers/comments_controller.rb

  def create
    params[:comment].merge!(character_id: params[:character_id],
                            user_id: current_user.id)

    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("body", "character_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Spiderman is the best"], ["character_id", 4], ["user_id", 1], ["created_at", "2016-06-01 23:41:43.126561"], ["updated_at", "2016-06-01 23:41:43.126561"]]